espressif/esp-idf/components/soc/esp32s31/register/soc/touch_reg.h
/** TOUCH_STATUS_8_REG register
 *  need_des
 */
#define TOUCH_STATUS_8_REG (DR_REG_TOUCH_BASE + 0x34)
/** TOUCH_PAD8_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD8_DATA    0x0000FFFFU
#define TOUCH_PAD8_DATA_M  (TOUCH_PAD8_DATA_V << TOUCH_PAD8_DATA_S)
#define TOUCH_PAD8_DATA_V  0x0000FFFFU
#define TOUCH_PAD8_DATA_S  0
/** TOUCH_PAD8_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD8_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD8_DEBOUNCE_CNT_M  (TOUCH_PAD8_DEBOUNCE_CNT_V << TOUCH_PAD8_DEBOUNCE_CNT_S)
#define TOUCH_PAD8_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD8_DEBOUNCE_CNT_S  16
/** TOUCH_PAD8_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD8_NN_CNT    0x0000000FU
#define TOUCH_PAD8_NN_CNT_M  (TOUCH_PAD8_NN_CNT_V << TOUCH_PAD8_NN_CNT_S)
#define TOUCH_PAD8_NN_CNT_V  0x0000000FU
#define TOUCH_PAD8_NN_CNT_S  19

/** TOUCH_STATUS_9_REG register
 *  need_des
 */
#define TOUCH_STATUS_9_REG (DR_REG_TOUCH_BASE + 0x38)
/** TOUCH_PAD9_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD9_DATA    0x0000FFFFU
#define TOUCH_PAD9_DATA_M  (TOUCH_PAD9_DATA_V << TOUCH_PAD9_DATA_S)
#define TOUCH_PAD9_DATA_V  0x0000FFFFU
#define TOUCH_PAD9_DATA_S  0
/** TOUCH_PAD9_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD9_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD9_DEBOUNCE_CNT_M  (TOUCH_PAD9_DEBOUNCE_CNT_V << TOUCH_PAD9_DEBOUNCE_CNT_S)
#define TOUCH_PAD9_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD9_DEBOUNCE_CNT_S  16
/** TOUCH_PAD9_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD9_NN_CNT    0x0000000FU
#define TOUCH_PAD9_NN_CNT_M  (TOUCH_PAD9_NN_CNT_V << TOUCH_PAD9_NN_CNT_S)
#define TOUCH_PAD9_NN_CNT_V  0x0000000FU
#define TOUCH_PAD9_NN_CNT_S  19

/** TOUCH_STATUS_10_REG register
 *  need_des
 */
#define TOUCH_STATUS_10_REG (DR_REG_TOUCH_BASE + 0x3c)
/** TOUCH_PAD10_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD10_DATA    0x0000FFFFU
#define TOUCH_PAD10_DATA_M  (TOUCH_PAD10_DATA_V << TOUCH_PAD10_DATA_S)
#define TOUCH_PAD10_DATA_V  0x0000FFFFU
#define TOUCH_PAD10_DATA_S  0
/** TOUCH_PAD10_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD10_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD10_DEBOUNCE_CNT_M  (TOUCH_PAD10_DEBOUNCE_CNT_V << TOUCH_PAD10_DEBOUNCE_CNT_S)
#define TOUCH_PAD10_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD10_DEBOUNCE_CNT_S  16
/** TOUCH_PAD10_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD10_NN_CNT    0x0000000FU
#define TOUCH_PAD10_NN_CNT_M  (TOUCH_PAD10_NN_CNT_V << TOUCH_PAD10_NN_CNT_S)
#define TOUCH_PAD10_NN_CNT_V  0x0000000FU
#define TOUCH_PAD10_NN_CNT_S  19

/** TOUCH_STATUS_11_REG register
 *  need_des
 */
#define TOUCH_STATUS_11_REG (DR_REG_TOUCH_BASE + 0x40)
/** TOUCH_PAD11_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD11_DATA    0x0000FFFFU
#define TOUCH_PAD11_DATA_M  (TOUCH_PAD11_DATA_V << TOUCH_PAD11_DATA_S)
#define TOUCH_PAD11_DATA_V  0x0000FFFFU
#define TOUCH_PAD11_DATA_S  0
/** TOUCH_PAD11_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD11_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD11_DEBOUNCE_CNT_M  (TOUCH_PAD11_DEBOUNCE_CNT_V << TOUCH_PAD11_DEBOUNCE_CNT_S)
#define TOUCH_PAD11_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD11_DEBOUNCE_CNT_S  16
/** TOUCH_PAD11_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD11_NN_CNT    0x0000000FU
#define TOUCH_PAD11_NN_CNT_M  (TOUCH_PAD11_NN_CNT_V << TOUCH_PAD11_NN_CNT_S)
#define TOUCH_PAD11_NN_CNT_V  0x0000000FU
#define TOUCH_PAD11_NN_CNT_S  19

/** TOUCH_STATUS_12_REG register
 *  need_des
 */
#define TOUCH_STATUS_12_REG (DR_REG_TOUCH_BASE + 0x44)
/** TOUCH_PAD12_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD12_DATA    0x0000FFFFU
#define TOUCH_PAD12_DATA_M  (TOUCH_PAD12_DATA_V << TOUCH_PAD12_DATA_S)
#define TOUCH_PAD12_DATA_V  0x0000FFFFU
#define TOUCH_PAD12_DATA_S  0
/** TOUCH_PAD12_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD12_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD12_DEBOUNCE_CNT_M  (TOUCH_PAD12_DEBOUNCE_CNT_V << TOUCH_PAD12_DEBOUNCE_CNT_S)
#define TOUCH_PAD12_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD12_DEBOUNCE_CNT_S  16
/** TOUCH_PAD12_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD12_NN_CNT    0x0000000FU
#define TOUCH_PAD12_NN_CNT_M  (TOUCH_PAD12_NN_CNT_V << TOUCH_PAD12_NN_CNT_S)
#define TOUCH_PAD12_NN_CNT_V  0x0000000FU
#define TOUCH_PAD12_NN_CNT_S  19

/** TOUCH_STATUS_13_REG register
 *  need_des
 */
#define TOUCH_STATUS_13_REG (DR_REG_TOUCH_BASE + 0x48)
/** TOUCH_PAD13_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD13_DATA    0x0000FFFFU
#define TOUCH_PAD13_DATA_M  (TOUCH_PAD13_DATA_V << TOUCH_PAD13_DATA_S)
#define TOUCH_PAD13_DATA_V  0x0000FFFFU
#define TOUCH_PAD13_DATA_S  0
/** TOUCH_PAD13_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD13_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD13_DEBOUNCE_CNT_M  (TOUCH_PAD13_DEBOUNCE_CNT_V << TOUCH_PAD13_DEBOUNCE_CNT_S)
#define TOUCH_PAD13_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD13_DEBOUNCE_CNT_S  16
/** TOUCH_PAD13_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD13_NN_CNT    0x0000000FU
#define TOUCH_PAD13_NN_CNT_M  (TOUCH_PAD13_NN_CNT_V << TOUCH_PAD13_NN_CNT_S)
#define TOUCH_PAD13_NN_CNT_V  0x0000000FU
#define TOUCH_PAD13_NN_CNT_S  19

/** TOUCH_STATUS_14_REG register
 *  need_des
 */
#define TOUCH_STATUS_14_REG (DR_REG_TOUCH_BASE + 0x4c)
/** TOUCH_PAD14_DATA : RO; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD14_DATA    0x0000FFFFU
#define TOUCH_PAD14_DATA_M  (TOUCH_PAD14_DATA_V << TOUCH_PAD14_DATA_S)
#define TOUCH_PAD14_DATA_V  0x0000FFFFU
#define TOUCH_PAD14_DATA_S  0
/** TOUCH_PAD14_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_PAD14_DEBOUNCE_CNT    0x00000007U
#define TOUCH_PAD14_DEBOUNCE_CNT_M  (TOUCH_PAD14_DEBOUNCE_CNT_V << TOUCH_PAD14_DEBOUNCE_CNT_S)
#define TOUCH_PAD14_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_PAD14_DEBOUNCE_CNT_S  16
/** TOUCH_PAD14_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_PAD14_NN_CNT    0x0000000FU
#define TOUCH_PAD14_NN_CNT_M  (TOUCH_PAD14_NN_CNT_V << TOUCH_PAD14_NN_CNT_S)
#define TOUCH_PAD14_NN_CNT_V  0x0000000FU
#define TOUCH_PAD14_NN_CNT_S  19

