espressif/esp-idf/components/soc/esp32s31/register/soc/touch_reg.h
/** TOUCH_STATUS_15_REG register
 *  need_des
 */
#define TOUCH_STATUS_15_REG (DR_REG_TOUCH_BASE + 0x50)
/** TOUCH_SLP_DATA : RO; bitpos: [15:0]; default: 65535;
 *  need_des
 */
#define TOUCH_SLP_DATA    0x0000FFFFU
#define TOUCH_SLP_DATA_M  (TOUCH_SLP_DATA_V << TOUCH_SLP_DATA_S)
#define TOUCH_SLP_DATA_V  0x0000FFFFU
#define TOUCH_SLP_DATA_S  0
/** TOUCH_SLP_DEBOUNCE_CNT : RO; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_SLP_DEBOUNCE_CNT    0x00000007U
#define TOUCH_SLP_DEBOUNCE_CNT_M  (TOUCH_SLP_DEBOUNCE_CNT_V << TOUCH_SLP_DEBOUNCE_CNT_S)
#define TOUCH_SLP_DEBOUNCE_CNT_V  0x00000007U
#define TOUCH_SLP_DEBOUNCE_CNT_S  16
/** TOUCH_SLP_NN_CNT : RO; bitpos: [22:19]; default: 0;
 *  need_des
 */
#define TOUCH_SLP_NN_CNT    0x0000000FU
#define TOUCH_SLP_NN_CNT_M  (TOUCH_SLP_NN_CNT_V << TOUCH_SLP_NN_CNT_S)
#define TOUCH_SLP_NN_CNT_V  0x0000000FU
#define TOUCH_SLP_NN_CNT_S  19

/** TOUCH_STATUS_16_REG register
 *  need_des
 */
#define TOUCH_STATUS_16_REG (DR_REG_TOUCH_BASE + 0x54)
/** TOUCH_APPROACH_PAD2_CNT : RO; bitpos: [7:0]; default: 0;
 *  need_des
 */
#define TOUCH_APPROACH_PAD2_CNT    0x000000FFU
#define TOUCH_APPROACH_PAD2_CNT_M  (TOUCH_APPROACH_PAD2_CNT_V << TOUCH_APPROACH_PAD2_CNT_S)
#define TOUCH_APPROACH_PAD2_CNT_V  0x000000FFU
#define TOUCH_APPROACH_PAD2_CNT_S  0
/** TOUCH_APPROACH_PAD1_CNT : RO; bitpos: [15:8]; default: 0;
 *  need_des
 */
#define TOUCH_APPROACH_PAD1_CNT    0x000000FFU
#define TOUCH_APPROACH_PAD1_CNT_M  (TOUCH_APPROACH_PAD1_CNT_V << TOUCH_APPROACH_PAD1_CNT_S)
#define TOUCH_APPROACH_PAD1_CNT_V  0x000000FFU
#define TOUCH_APPROACH_PAD1_CNT_S  8
/** TOUCH_APPROACH_PAD0_CNT : RO; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define TOUCH_APPROACH_PAD0_CNT    0x000000FFU
#define TOUCH_APPROACH_PAD0_CNT_M  (TOUCH_APPROACH_PAD0_CNT_V << TOUCH_APPROACH_PAD0_CNT_S)
#define TOUCH_APPROACH_PAD0_CNT_V  0x000000FFU
#define TOUCH_APPROACH_PAD0_CNT_S  16
/** TOUCH_SLP_APPROACH_CNT : RO; bitpos: [31:24]; default: 0;
 *  need_des
 */
#define TOUCH_SLP_APPROACH_CNT    0x000000FFU
#define TOUCH_SLP_APPROACH_CNT_M  (TOUCH_SLP_APPROACH_CNT_V << TOUCH_SLP_APPROACH_CNT_S)
#define TOUCH_SLP_APPROACH_CNT_V  0x000000FFU
#define TOUCH_SLP_APPROACH_CNT_S  24

/** TOUCH_STATUS_17_REG register
 *  need_des
 */
#define TOUCH_STATUS_17_REG (DR_REG_TOUCH_BASE + 0x58)
/** TOUCH_DCAP_LPF : RO; bitpos: [6:0]; default: 0;
 *  Reserved
 */
#define TOUCH_DCAP_LPF    0x0000007FU
#define TOUCH_DCAP_LPF_M  (TOUCH_DCAP_LPF_V << TOUCH_DCAP_LPF_S)
#define TOUCH_DCAP_LPF_V  0x0000007FU
#define TOUCH_DCAP_LPF_S  0
/** TOUCH_DRES_LPF : RO; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define TOUCH_DRES_LPF    0x00000003U
#define TOUCH_DRES_LPF_M  (TOUCH_DRES_LPF_V << TOUCH_DRES_LPF_S)
#define TOUCH_DRES_LPF_V  0x00000003U
#define TOUCH_DRES_LPF_S  7
/** TOUCH_DRV_LS : RO; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define TOUCH_DRV_LS    0x0000000FU
#define TOUCH_DRV_LS_M  (TOUCH_DRV_LS_V << TOUCH_DRV_LS_S)
#define TOUCH_DRV_LS_V  0x0000000FU
#define TOUCH_DRV_LS_S  9
/** TOUCH_DRV_HS : RO; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define TOUCH_DRV_HS    0x0000001FU
#define TOUCH_DRV_HS_M  (TOUCH_DRV_HS_V << TOUCH_DRV_HS_S)
#define TOUCH_DRV_HS_V  0x0000001FU
#define TOUCH_DRV_HS_S  13
/** TOUCH_DBIAS : RO; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define TOUCH_DBIAS    0x0000001FU
#define TOUCH_DBIAS_M  (TOUCH_DBIAS_V << TOUCH_DBIAS_S)
#define TOUCH_DBIAS_V  0x0000001FU
#define TOUCH_DBIAS_S  18
/** TOUCH_FREQ_SCAN_CNT : RO; bitpos: [24:23]; default: 0;
 *  need_des
 */
#define TOUCH_FREQ_SCAN_CNT    0x00000003U
#define TOUCH_FREQ_SCAN_CNT_M  (TOUCH_FREQ_SCAN_CNT_V << TOUCH_FREQ_SCAN_CNT_S)
#define TOUCH_FREQ_SCAN_CNT_V  0x00000003U
#define TOUCH_FREQ_SCAN_CNT_S  23

/** TOUCH_CHN_TMP_STATUS_REG register
 *  need_des
 */
#define TOUCH_CHN_TMP_STATUS_REG (DR_REG_TOUCH_BASE + 0x5c)
/** TOUCH_PAD_INACTIVE_STATUS : RO; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define TOUCH_PAD_INACTIVE_STATUS    0x00007FFFU
#define TOUCH_PAD_INACTIVE_STATUS_M  (TOUCH_PAD_INACTIVE_STATUS_V << TOUCH_PAD_INACTIVE_STATUS_S)
#define TOUCH_PAD_INACTIVE_STATUS_V  0x00007FFFU
#define TOUCH_PAD_INACTIVE_STATUS_S  0
/** TOUCH_PAD_ACTIVE_STATUS : RO; bitpos: [29:15]; default: 0;
 *  need_des
 */
#define TOUCH_PAD_ACTIVE_STATUS    0x00007FFFU
#define TOUCH_PAD_ACTIVE_STATUS_M  (TOUCH_PAD_ACTIVE_STATUS_V << TOUCH_PAD_ACTIVE_STATUS_S)
#define TOUCH_PAD_ACTIVE_STATUS_V  0x00007FFFU
#define TOUCH_PAD_ACTIVE_STATUS_S  15

/** TOUCH_DATE_REG register
 *  need_des
 */
#define TOUCH_DATE_REG (DR_REG_TOUCH_BASE + 0x100)
/** TOUCH_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define TOUCH_CLK_EN    (BIT(31))
#define TOUCH_CLK_EN_M  (TOUCH_CLK_EN_V << TOUCH_CLK_EN_S)
#define TOUCH_CLK_EN_V  0x00000001U
#define TOUCH_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
